Clomann/stm32h7-CAN-sniffer/drivers/fdcan/fdcan.c
/*
 * fdcan.c
 *
 *  Created on: 14.09.2024
 *      Author: Clemens
 */

#include "fdcan.h"
#include "CommTypes.h"
#include "fdcan_utils.h"
#include "nvic_irg_config.h"
#include "stm32h7xx_hal_fdcan.h"
#include "stm32h7xx_hal_rcc_ex.h"
#include <stdint.h>

#define FDCAN_1_NBR        COMM_DEVICE_NUMBER_1
#define FDCAN_2_NBR        COMM_DEVICE_NUMBER_2

typedef struct {
    FDCAN_GlobalTypeDef *fdcan;
    FDCAN_HandleTypeDef hfdcan;
    FDCAN_RxHeaderTypeDef rxheader;
    uint64_t mostRecentInterrupTimestamp;
} FdcanInstanceType;

static FdcanInstanceType fdcan_hfdcan[FDCAN_MAX_INSTANCES] = {
    {
        .fdcan=NULL,
        .mostRecentInterrupTimestamp=0
    },
    {
        .fdcan=NULL,
        .mostRecentInterrupTimestamp=0
    }
};

CommDriverConfigType Can1Cfg;

/* Private function prototypes -----------------------------------------------*/
comm_status_t FDCAN_Ioctl(
    CommDriver *handle,
    int cmd,
    void *argument);

comm_status_t fdcan_find_free(FdcanInstanceType **handle)
{
    comm_status_t res = COMM_ERROR;

    for (uint8_t i=0; i < FDCAN_MAX_INSTANCES; i++)
    {
        if (NULL == fdcan_hfdcan[i].fdcan)
        {
            *handle = &fdcan_hfdcan[i];
            res = COMM_SUCCESS;
            break;
        }
    }

    return res;
}

comm_status_t fdcan_get_can(CommDriver *dev, FDCAN_HandleTypeDef **fdcan)
{
    FdcanInstanceType * instance;

    instance = (FdcanInstanceType *) dev->instance;

    *fdcan = &instance->hfdcan;

    return COMM_SUCCESS;
}

comm_status_t fdcan_get_handle(FDCAN_GlobalTypeDef *fdcan, FdcanInstanceType **handle)
{
    if (NULL == fdcan)
    {
        return COMM_ERROR;
    }

    for (uint8_t i=0; i < FDCAN_MAX_INSTANCES; i++)
    {
        if (fdcan == fdcan_hfdcan[i].fdcan)
        {
            *handle = &fdcan_hfdcan[i];
            return COMM_SUCCESS;
        }
    }

    return COMM_ERROR;
}

comm_status_t get_fdcan_config(
        FdcanInstanceType *,
		FDCAN_FilterTypeDef *);

comm_status_t fdcan_init_tx_header(
    const void *,
    FDCAN_TxHeaderTypeDef *,
    uint32_t);

uint64_t  SampleTime(void);

comm_status_t FDCAN_CreateDriver(
    CommDriver *pDriver,
    const void *cfg,
    size_t cfg_size,
    uint8_t *tx,
    uint8_t *rx)
{
	comm_status_t RetVal;
    FdcanInstanceType * instance;

	RetVal = COMM_ERROR;
    pDriver->config = (CommDriverConfigType *)cfg;

    if (sizeof(CommDriverConfigType) != cfg_size)
    {
        FDCAN_ErrorHandler();
    }

    if (COMM_SUCCESS != fdcan_find_free(&instance))
    {
        RetVal = COMM_ERROR;
        FDCAN_ErrorHandler();
    }

    switch (pDriver->config->devNbr)
    {
    case COMM_DEVICE_NUMBER_1:
        instance->fdcan = FDCAN_1;
        RetVal = COMM_SUCCESS;
        break;
    case COMM_DEVICE_NUMBER_2:
        instance->fdcan = FDCAN_2;
        RetVal = COMM_SUCCESS;
        break;
    default:
        RetVal = COMM_ERROR;
        break;
    }

    if (COMM_SUCCESS != RetVal)
    {
        FDCAN_ErrorHandler();
    }

    pDriver->instance = (void *) instance;

	pDriver->interface->init = FDCAN_Init;
	pDriver->interface->send = FDCAN_Send;
	pDriver->interface->read = FDCAN_Read;
    pDriver->interface->ioctl = FDCAN_Ioctl;
	pDriver->state = DRIVER_STATE_UNINITIALIZED;
	pDriver->protocol = DRIVER_FDCAN;
	pDriver->TxFrameBuffer = tx;
    pDriver->RxFrameBuffer = rx;

    pDriver->state = DRIVER_STATE_INITIALIZED;
    RetVal = COMM_SUCCESS;

	return RetVal;
}

COMM_REGISTER_DRIVER(DRIVER_FDCAN, FDCAN_CreateDriver);

comm_status_t FDCAN_Init(
    CommDriver *dev)
{
	FDCAN_FilterTypeDef sFilterConfig;
	comm_status_t RetVal;
    FdcanInstanceType * instance;

    RetVal = COMM_SUCCESS;
    instance = (FdcanInstanceType *) dev->instance;

    // TODO make init function consistent with driver creation
    get_fdcan_config(instance, &sFilterConfig);

#if FDCCAN_USE_TIMESTAMP_COUNTER
    HAL_FDCAN_EnableTimestampCounter(&instance->hfdcan, FDCAN_TIMESTAMP_EXTERNAL);
#else
    HAL_FDCAN_EnableTimestampCounter(&instance->hfdcan, FDCAN_TIMESTAMP_INTERNAL);
#endif


    if (HAL_FDCAN_Init(&instance->hfdcan) != HAL_OK)
    {
        /* Initialization Error */
        RetVal = COMM_ERROR;
    }

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }

    if (HAL_FDCAN_ConfigTimestampCounter(&instance->hfdcan, FDCAN_TIMESTAMP_PRESC_1) != HAL_OK)
    {
        /* Initialization Error */
        RetVal = COMM_ERROR;
    }

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }

    if (HAL_FDCAN_EnableTimestampCounter(&instance->hfdcan, FDCAN_TIMESTAMP_EXTERNAL) != HAL_OK)
    {
        /* Initialization Error */
        RetVal = COMM_ERROR;
    }

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }

    /* Configure Rx filter */
    if (HAL_FDCAN_ConfigFilter(&instance->hfdcan, &sFilterConfig) != HAL_OK)
    {
        /* Filter configuration Error */
        RetVal = COMM_ERROR;
    }

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }

#if ((FDCAN_IRQ_NOTIFICATION == FDCAN_IT_RX_FIFO0_WATERMARK))
#if FDCAN_IRQ_RX_WATERMARK < 2
#error "Implausible value for FDCAN_IRQ_RX_WATERMARK!"
#endif
    HAL_FDCAN_ConfigFifoWatermark(&instance->hfdcan, FDCAN_CFG_RX_FIFO0, FDCAN_IRQ_RX_WATERMARK);

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }
#endif

    if (HAL_FDCAN_ActivateNotification(&instance->hfdcan, FDCAN_IRQ_NOTIFICATION, 0) != HAL_OK)
    {
        /* Notification Error */
        RetVal = COMM_ERROR;
    }

    if (0 != instance->hfdcan.ErrorCode)
    {
        FDCAN_ErrorHandler();
    }

    /* Prepare Tx Header */

    if (0 == RetVal)
    {
        dev->state = DRIVER_STATE_INITIALIZED;
    }
    return RetVal;
}

comm_status_t FDCAN_DeInit(
    CommDriver *dev)
{
	comm_status_t RetVal;
    FdcanInstanceType * instance;

    RetVal = COMM_SUCCESS;
    instance = (FdcanInstanceType *) dev->instance;

    if (HAL_FDCAN_DeactivateNotification(&instance->hfdcan, FDCAN_IRQ_NOTIFICATION) != HAL_OK)
    {
        /* Notification Error */
        RetVal = COMM_ERROR;
    }

    /* Stop the FDCAN module */
    if (HAL_FDCAN_Stop(&instance->hfdcan) != HAL_OK)
    {
        /* Start Error */
        RetVal = COMM_ERROR;
    }

    if (HAL_FDCAN_DisableTimestampCounter(&instance->hfdcan) != HAL_OK)
    {
        /* Initialization Error */
        RetVal = COMM_ERROR;
    }

    if (HAL_FDCAN_DeInit(&instance->hfdcan) != HAL_OK)
    {
        /* Initialization Error */
        RetVal = COMM_ERROR;
    }

    return RetVal;
}

comm_status_t FDCAN_Send(
    CommDriver *dev,
    const void *pMsg)
{
	comm_status_t RetVal;
	uint8_t * pData;
	FDCAN_Message *pMsgCpy;
	FDCAN_TxHeaderTypeDef TxHeader;
    FdcanInstanceType * instance;

    if (DRIVER_STATE_STARTED != dev->state)
    {
        return COMM_INVALID_STATE;
    }

