Clomann/stm32h7-CAN-sniffer/drivers/fdcan/fdcan.c
    RetVal = COMM_SUCCESS;
    instance = (FdcanInstanceType *) dev->instance;
    pMsgCpy = (FDCAN_Message*)pMsg;
    pData = (uint8_t*)(pMsgCpy->msgBase.payload);

	(void)fdcan_init_tx_header(pMsgCpy, &TxHeader, pMsgCpy->msgBase.length);

    if (HAL_FDCAN_STATE_BUSY != HAL_FDCAN_GetState(&instance->hfdcan))
    {
        RetVal = COMM_ERROR;
    }
	else if (HAL_FDCAN_AddMessageToTxFifoQ(&instance->hfdcan, &TxHeader, pData) == HAL_OK)
	{
		RetVal = COMM_SUCCESS;
	}
	else
	{
		RetVal = COMM_ERROR;
	}

	return RetVal;
}

comm_status_t FDCAN_Read(
    CommDriver *dev,
    void *pFrame,
    uint8_t length,
    uint32_t RxFifo0ITs)
{
  comm_status_t RetVal;
  uint8_t Data[8];
  FDCAN_ClassicFrameType *pNewFrame;
  FdcanInstanceType * instance;

  RetVal = COMM_SUCCESS;
  instance = (FdcanInstanceType *) dev->instance;
  pNewFrame = (FDCAN_ClassicFrameType*)pFrame;

  if((RxFifo0ITs & FDCAN_IRQ_NOTIFICATION) != RESET)
  {
    /* Retreive Rx messages from RX FIFO0 */
    if (HAL_FDCAN_GetRxMessage(&instance->hfdcan, FDCAN_RX_FIFO0, &instance->rxheader, Data) != HAL_OK)
    {
    	/* Reception Error */
    	RetVal = COMM_ERROR;
    }

    switch (instance->rxheader.BitRateSwitch)
    {
        case FDCAN_BRS_ON:
            FDCAN_SET_BRS(pNewFrame, 1U);
            break;
        case FDCAN_BRS_OFF:
        default:
            FDCAN_SET_BRS(pNewFrame, 0U);
            break;
    }

    switch (instance->rxheader.ErrorStateIndicator)
    {
        case FDCAN_ESI_ACTIVE:
            FDCAN_SET_ESI(pNewFrame, 1U);
            break;
        case FDCAN_ESI_PASSIVE:
        default:
            FDCAN_SET_ESI(pNewFrame, 0U);
            break;
    }

    switch (instance->rxheader.IdType)
    {
        case FDCAN_EXTENDED_ID:
            FDCAN_SET_IDE(pNewFrame, 1U);
            break;
        case FDCAN_STANDARD_ID:
        default:
            FDCAN_SET_IDE(pNewFrame, 0U);
            break;
    }

    switch (instance->rxheader.FDFormat)
    {
        case FDCAN_FD_CAN:
            FDCAN_SET_FDF(pNewFrame, 1U);
            break;
        case FDCAN_CLASSIC_CAN:
        default:
            FDCAN_SET_FDF(pNewFrame, 0U);
            break;
    }

    switch (instance->rxheader.DataLength)
    {
		case FDCAN_DLC_BYTES_0:
            FDCAN_SET_DLC(pNewFrame, 0);
            FDCAN_SET_DATA_LEN(pNewFrame, 0);
			break;
		case FDCAN_DLC_BYTES_1:
			FDCAN_SET_DLC(pNewFrame, 1);
            FDCAN_SET_DATA_LEN(pNewFrame, 1);
			break;
		case FDCAN_DLC_BYTES_2:
			FDCAN_SET_DLC(pNewFrame, 2);
            FDCAN_SET_DATA_LEN(pNewFrame, 2);
			break;
		case FDCAN_DLC_BYTES_3:
			FDCAN_SET_DLC(pNewFrame, 3);
			FDCAN_SET_DATA_LEN(pNewFrame, 3);
			break;
		case FDCAN_DLC_BYTES_4:
			FDCAN_SET_DLC(pNewFrame, 4);
			FDCAN_SET_DATA_LEN(pNewFrame, 4);
			break;
		case FDCAN_DLC_BYTES_5:
			FDCAN_SET_DLC(pNewFrame, 5);
			FDCAN_SET_DATA_LEN(pNewFrame, 5);
			break;
		case FDCAN_DLC_BYTES_6:
			FDCAN_SET_DLC(pNewFrame, 6);
			FDCAN_SET_DATA_LEN(pNewFrame, 6);
			break;
		case FDCAN_DLC_BYTES_7:
			FDCAN_SET_DLC(pNewFrame, 7);
			FDCAN_SET_DATA_LEN(pNewFrame, 7);
			break;
		case FDCAN_DLC_BYTES_8:
			FDCAN_SET_DLC(pNewFrame, 8);
			FDCAN_SET_DATA_LEN(pNewFrame, 8);
			break;
        case FDCAN_DLC_BYTES_12:
            FDCAN_SET_DLC(pNewFrame, 9);
            FDCAN_SET_DATA_LEN(pNewFrame, 12);
            break;
        case FDCAN_DLC_BYTES_16:
            FDCAN_SET_DLC(pNewFrame, 10);
            FDCAN_SET_DATA_LEN(pNewFrame, 16);
            break;
        case FDCAN_DLC_BYTES_20:
            FDCAN_SET_DLC(pNewFrame, 11);
            FDCAN_SET_DATA_LEN(pNewFrame, 20);
            break;
        case FDCAN_DLC_BYTES_24:
            FDCAN_SET_DLC(pNewFrame, 12);
            FDCAN_SET_DATA_LEN(pNewFrame, 24);
            break;
        case FDCAN_DLC_BYTES_32:
            FDCAN_SET_DLC(pNewFrame, 13);
            FDCAN_SET_DATA_LEN(pNewFrame, 32);
            break;
        case FDCAN_DLC_BYTES_48:
            FDCAN_SET_DLC(pNewFrame, 14);
            FDCAN_SET_DATA_LEN(pNewFrame, 48);
            break;
        case FDCAN_DLC_BYTES_64:
            FDCAN_SET_DLC(pNewFrame, 15);
            FDCAN_SET_DATA_LEN(pNewFrame, 64);
            break;
		default:
			FDCAN_SET_DLC(pNewFrame,  0);
            FDCAN_SET_DATA_LEN(pNewFrame,  0);
    };

    pNewFrame->id = instance->rxheader.Identifier;
    pNewFrame->timestamp = instance->rxheader.RxTimestamp;

    memcpy(pNewFrame->data, &Data, FDCAN_GET_DLC(pNewFrame));

    if (HAL_FDCAN_ActivateNotification(&instance->hfdcan, FDCAN_IRQ_NOTIFICATION, 0) != HAL_OK)
    {
      /* Notification Error */
    	RetVal = COMM_ERROR;
    }
  }

  return RetVal;
}

comm_status_t FDCAN_RegisterTxMessage(Message *pMsg)
{
	return COMM_ERROR;
}

comm_status_t FDCAN_RegisterRxMessage(Message *pMsg)
{
	return COMM_ERROR;
}

uint64_t FDCAN_GetMostRecentInterruptTimestamp(CommDriver *dev)
{
    return ((FdcanInstanceType*)dev->instance)->mostRecentInterrupTimestamp;
}

void FDCAN_1_IRQHandler(void)
{
    FdcanInstanceType * instance;

    if (COMM_SUCCESS != fdcan_get_handle(FDCAN1, &instance))
    {
        FDCAN_ErrorHandler();
    }

    /* capture timestamp at the moment of the interrupt */
    instance->mostRecentInterrupTimestamp = SampleTime();
    HAL_FDCAN_IRQHandler(&instance->hfdcan);
}

void FDCAN_2_IRQHandler(void)
{
    FdcanInstanceType * instance;

    if (COMM_SUCCESS != fdcan_get_handle(FDCAN2, &instance))
    {
        FDCAN_ErrorHandler();
    }

    instance->mostRecentInterrupTimestamp = SampleTime();
    HAL_FDCAN_IRQHandler(&instance->hfdcan);
}

/* IOCTL/ driver specific functions */

static comm_status_t FDCAN_SetBaudrate(
    CommDriver *dev,
    uint32_t baudrate)
{
    comm_status_t res = 0;
    uint32_t FdcanClock = 0;
    uint8_t timings[4];
    bool IsDataPhase = false;
    uint16_t Prescaler;
    uint8_t Seg1;
    uint8_t Seg2;
    uint8_t Sjw;
    FdcanInstanceType * instance;

    instance = (FdcanInstanceType *)dev->instance;
    FdcanClock = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_FDCAN);

