Clomann/stm32h7-CAN-sniffer/drivers/fdcan/fdcan.c
    res = COMM_SUCCESS;
    switch (baudrate)
    {
        case FDCAN_BAUDRATE_250000:
        case FDCAN_BAUDRATE_500000:
        case FDCAN_BAUDRATE_1000000:
            break;
        default:
            res = COMM_INVALID_PARAMETER;
            break;
    }

    memset(timings, 0x00, sizeof(timings));

    if (COMM_SUCCESS != res)
    {
    }
    else if (0 == CANFD_CalculateBitTimingRegister(FdcanClock, baudrate, 7500, 1, IsDataPhase, timings))
    {
        res = COMM_SUCCESS;
    }
    else
    {
        res = COMM_ERROR;
    }

    if (COMM_SUCCESS == res)
    {
        Prescaler  = CANFD_GetPrescaler(timings, IsDataPhase);
        Seg1       = CANFD_GetSeg1(timings, IsDataPhase);
        Seg2       = CANFD_GetSeg2(timings, IsDataPhase);
        Sjw        = CANFD_GetSJW(timings, IsDataPhase);

        instance->hfdcan.Init.NominalPrescaler     = Prescaler;
        instance->hfdcan.Init.NominalSyncJumpWidth = Sjw;
        instance->hfdcan.Init.NominalTimeSeg1      = Seg1;
        instance->hfdcan.Init.NominalTimeSeg2      = Seg2;

        if (HAL_FDCAN_Init(&instance->hfdcan) != HAL_OK)
        {
            /* Initialization Error */
            res = COMM_ERROR;
        }
    }

    return res;
}

static comm_status_t FDCAN_SetMode(
    CommDriver *dev,
    uint32_t mode)
{
    comm_status_t res = 0;
    FdcanInstanceType * instance;

    instance = (FdcanInstanceType *)dev->instance;

    switch (mode)
    {
        case FDCAN_MODE_1:
            instance->hfdcan.Init.Mode = FDCAN_MODE_NORMAL;
            res = COMM_SUCCESS;
            break;
        case FDCAN_MODE_2:
            instance->hfdcan.Init.Mode = FDCAN_MODE_BUS_MONITORING;
            res = COMM_SUCCESS;
            break;
        default:
            res = COMM_INVALID_PARAMETER;
            break;
    }

    if (COMM_SUCCESS == res)
    {
        if (HAL_FDCAN_Init(&instance->hfdcan) != HAL_OK)
        {
            /* Initialization Error */
            res = COMM_ERROR;
        }
    }

    return res;
}

comm_status_t FDCAN_Ioctl(
    CommDriver *dev,
    int cmd,
    void *argument)
{
    int HalRes = 0;
    comm_status_t res = 0;
    FdcanInstanceType * instance;

    instance = (FdcanInstanceType *) dev->instance;

    switch (cmd)
    {
        case CANABS_IOCTL_CMD_SET_BAUDRATE:
            {
                FdcanBaudrateType baudrate = *((FdcanBaudrateType *)argument);
                res = FDCAN_SetBaudrate(dev, baudrate);
            }
            break;
        case CANABS_IOCTL_CMD_START:
            if (DRIVER_STATE_STARTED == dev->state)
            {
                /* nothing to do */
            }
            else if (HAL_OK != HAL_FDCAN_Start(&instance->hfdcan))
            {
                /* Start Error */
                res = COMM_ERROR;
                FDCAN_ErrorHandler();
            }
            else if (HAL_OK == HAL_FDCAN_AbortTxRequest(&instance->hfdcan,
                                        FDCAN_TX_BUFFER0 | FDCAN_TX_BUFFER1 | FDCAN_TX_BUFFER2))
            {
                HAL_FDCAN_ActivateNotification(&instance->hfdcan, FDCAN_IRQ_NOTIFICATION, 0);
            }

            if (COMM_SUCCESS == res)
            {
                dev->state = DRIVER_STATE_STARTED;
            }
            else
            {
                res = COMM_ERROR;
            }
            break;
        case CANABS_IOCTL_CMD_STOP:
            if (DRIVER_STATE_STARTED != dev->state)
            {
                /* nothing to do */
            }
            else if ( (HAL_FDCAN_DeactivateNotification(&instance->hfdcan,
                        FDCAN_IRQ_NOTIFICATION) != HAL_OK ) )
            {
                /* Start Error */
                res = COMM_ERROR;
                FDCAN_ErrorHandler();
            }
            else if (HAL_FDCAN_Stop(&instance->hfdcan) != HAL_OK)
            {
                /* Start Error */
                res = COMM_ERROR;
                FDCAN_ErrorHandler();
            }
            else if ((HalRes = HAL_FDCAN_AbortTxRequest(&instance->hfdcan,
                        FDCAN_TX_BUFFER0 | FDCAN_TX_BUFFER1 | FDCAN_TX_BUFFER2)) != HAL_OK)
            {
                /* Start Error */
                res = COMM_ERROR;
                (void) (HalRes);
                FDCAN_ErrorHandler();
            }
            else
            {
                __HAL_FDCAN_CLEAR_IT(&instance->hfdcan, FDCAN_IRQ_NOTIFICATION);
            }

            if (COMM_SUCCESS == res || (instance->hfdcan.ErrorCode & HAL_FDCAN_ERROR_NOT_STARTED) )
            {
                dev->state = DRIVER_STATE_STOPPED;
            }
            break;
        case CANABS_IOCTL_CMD_SET_MODE:
            {
                FdcanModeType mode = *((FdcanModeType *)argument);
                res = FDCAN_SetMode(dev, mode);

                if (COMM_SUCCESS == res && mode == FDCAN_MODE_3)
                {
                    dev->state = DRIVER_STATE_OFF;
                }
            }
            break;
            break;
        case CANABS_IOCTL_CMD_SET_FILTERMASK:
        default:
            res = 1;
            break;
    }

    return res;
}

static inline void gpio_clk_enable(GPIO_TypeDef *port)
{
    if (port == GPIOA)
    {
        __HAL_RCC_GPIOA_CLK_ENABLE();
    }
    else if (port == GPIOB)
    {
        __HAL_RCC_GPIOB_CLK_ENABLE();
    }
    else if (port == GPIOC)
    {
        __HAL_RCC_GPIOC_CLK_ENABLE();
    }
    else if (port == GPIOD)
    {
        __HAL_RCC_GPIOD_CLK_ENABLE();
    }
    else if (port == GPIOE)
    {
        __HAL_RCC_GPIOE_CLK_ENABLE();
    }
#ifdef GPIOF
    else if (port == GPIOF)
    {
        __HAL_RCC_GPIOF_CLK_ENABLE();
    }
#endif
#ifdef GPIOG
    else if (port == GPIOG)
    {
        __HAL_RCC_GPIOG_CLK_ENABLE();
    }
#endif
#ifdef GPIOH
    else if (port == GPIOH)
    {
        __HAL_RCC_GPIOH_CLK_ENABLE();
    }
#endif
}

HAL_StatusTypeDef FDCAN_GpioClck(FDCAN_GlobalTypeDef *fdcan)
{
    HAL_StatusTypeDef res;

    res = HAL_OK;

    if (FDCAN_1 == fdcan)
    {
        CLK_ENABLE(FDCAN_1_TX_GPIO_PORT);
        CLK_ENABLE(FDCAN_1_RX_GPIO_PORT);
    }
    else if (FDCAN_2 == fdcan)
    {
        CLK_ENABLE(FDCAN_2_TX_GPIO_PORT);
        CLK_ENABLE(FDCAN_2_RX_GPIO_PORT);
    }
    else
    {
        res = HAL_ERROR;
    }

    return res;
}

