Clomann/stm32h7-CAN-sniffer/drivers/fdcan/fdcan.c
        sample point at 75 %
    */
    instance->hfdcan.Instance = instance->fdcan;
    instance->hfdcan.Init.FrameFormat = FDCAN_FRAME_CLASSIC;
    instance->hfdcan.Init.Mode = FDCAN_MODE_DEFAULT;
    instance->hfdcan.Init.AutoRetransmission = ENABLE;
    instance->hfdcan.Init.TransmitPause = DISABLE;
    instance->hfdcan.Init.ProtocolException = ENABLE;
    instance->hfdcan.Init.NominalPrescaler = 0x4; /* tq = NominalPrescaler x (1/fdcan_ker_ck) */
    instance->hfdcan.Init.NominalSyncJumpWidth = 0x01;
    instance->hfdcan.Init.NominalTimeSeg1 = 34U; /* NominalTimeSeg1 = Propagation_segment + Phase_segment_1 */
    instance->hfdcan.Init.NominalTimeSeg2 = 5U;
    ram_usage(instance->fdcan, &instance->hfdcan.Init.MessageRAMOffset);
    instance->hfdcan.Init.StdFiltersNbr = 1;
    instance->hfdcan.Init.ExtFiltersNbr = 0;
    instance->hfdcan.Init.RxFifo0ElmtsNbr = FDCAN_RAM_RX_ELEMENTS;
    instance->hfdcan.Init.RxFifo0ElmtSize = FDCAN_DATA_BYTES_8;
    instance->hfdcan.Init.RxFifo1ElmtsNbr = 0;
    instance->hfdcan.Init.RxBuffersNbr = 0;
    instance->hfdcan.Init.TxEventsNbr = 0;
    instance->hfdcan.Init.TxBuffersNbr = 0;
    instance->hfdcan.Init.TxFifoQueueElmtsNbr = FDCAN_RAM_TX_ELEMENTS;
    instance->hfdcan.Init.TxFifoQueueMode = FDCAN_TX_FIFO_OPERATION;
    instance->hfdcan.Init.TxElmtSize = FDCAN_DATA_BYTES_8;

    pFilterConfig->IdType = FDCAN_STANDARD_ID;
    pFilterConfig->FilterIndex = 0;
    pFilterConfig->FilterType = FDCAN_FILTER_MASK;
    pFilterConfig->FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
    pFilterConfig->FilterID1 = 0x0;
    pFilterConfig->FilterID2 = 0x7FF;

    RetVal = COMM_SUCCESS;

	return RetVal;
}

uint64_t SampleTime(void)
{
    return FDCAN_GetTimestampHook();
}
